sincere360/M1_SiN360/m1_csrc/m1_esp32_fw_update.c
	xQueueReset(main_q_hdl); // Reset main q before return

} // void setting_esp32_image_file(void)



/******************************************************************************/
/**
  * @brief
  * @param None
  * @retval None
  */
/******************************************************************************/
void setting_esp32_start_address(void)
{

} // void setting_esp32_start_address(void)



/******************************************************************************/
/**
  * @brief
  * @param None
  * @retval None
  */
/******************************************************************************/
void setting_esp32_firmware_update(void)
{
	uint8_t uret, old_op_mode;

	uret = M1_FW_UPDATE_NOT_READY;
	if ( !m1_check_battery_level(50) ) // Is battery level less than 50%?
    {
    	esp32_update_status = M1_FW_UPDATE_NOT_READY; // Force quit
    	uret = M1_FW_UPDATE_LOW_BATTERY;
    } // if ( !m1_check_battery_level(50) )

	old_op_mode = m1_device_stat.op_mode;

    do
    {
        if ( esp32_update_status!=M1_FW_UPDATE_READY )
        {
        	break;
        }
		//
		// - Check for battery status before proceeding
		// - Write status to RTC backup registers. If something goes wrong and causes reboot,
		// the device will read the status from those registers after reset.
		//

        m1_device_stat.op_mode = M1_OPERATION_MODE_FIRMWARE_UPDATE;

        m1_led_fw_update_on(NULL); // Turn on
		esp32_UART_deinit(); // Disable the ESP32 module first
    	uret = m1_fw_app(&hfile_fw);
		if ( uret != ESP_LOADER_SUCCESS )
		{
			uret = M1_FW_UPDATE_FAILED;
		}
		else
		{
			uret = M1_FW_UPDATE_SUCCESS;
		}
		m1_fb_close_file(&hfile_fw);
		m1_led_fw_update_off(); // Turn off
    } while (0);

    esp32_update_status = uret;

	if ( (uret==M1_FW_UPDATE_SUCCESS) || (uret==M1_FW_UPDATE_FAILED) )
	{
		esp32_UART_change_baudrate(ESP32_UART_BAUDRATE); // Change to ESP32 default baud rate
		m1_ringbuffer_reset(&esp32_rb_hdl);
		esp_loader_reset_target(); // Reset ESP32 to get the boot message

		// Delay for skipping the boot message of the targets
		HAL_Delay(100);
		esp32_UART_deinit(); // Disable UART GPIO after update process is done
	} // if ( (uret==M1_FW_UPDATE_FAILED) || (uret==M1_FW_UPDATE_SUCCESS) )

	m1_device_stat.op_mode = old_op_mode;

    xQueueReset(main_q_hdl); // Reset main q before return
} // void setting_esp32_firmware_update(void)



/******************************************************************************/
/**
  * @brief
  * @param None
  * @retval None
  */
/******************************************************************************/
static esp_loader_error_t m1_fw_app(FIL *hfile)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	esp_loader_error_t flash_err;
	size_t write_size, count;
    uint8_t buffer[ESP32_IMAGE_CHUNK_SIZE];

	loader_stm32_config_t config = {
		.huart = &huart_esp,
	    .port_io0 = ESP32_IO9_GPIO_Port,
	    .pin_num_io0 = ESP32_IO9_Pin,
	    .port_rst = ESP32_RESET_GPIO_Port,
	    .pin_num_rst = ESP32_RESET_Pin,
	};

	write_size = image_size;
	fw_gui_progress_update(write_size);

	loader_port_stm32_init(&config);
	esp32_UART_init();

	// Configure the BUTTON_RIGHT to become an output pin
	// This GPIO is shared with the ESP32 boot-mode pin
	GPIO_InitStruct.Pin = ESP32_IO9_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(ESP32_IO9_GPIO_Port, &GPIO_InitStruct);

	HAL_GPIO_WritePin(ESP32_IO9_GPIO_Port, ESP32_IO9_Pin, GPIO_PIN_SET);

	flash_err = ESP_LOADER_ERROR_FAIL;
	while (connect_to_target(ESP32_UART_HIGH_BAUDRATE)==ESP_LOADER_SUCCESS)
	{
		f_lseek(hfile, 0); // Move file pointer to the beginning of the file
		//write_size = image_size;
		progress_percent_count = 0;
		while ( write_size )
		{
			flash_err = ESP_LOADER_ERROR_FAIL;
			count = m1_fb_read_from_file(hfile, buffer, ESP32_IMAGE_CHUNK_SIZE);
			if ( !count ) // Read failed?
				break;
			flash_err = m1_fw_flash_binary(buffer, count);
			if ( flash_err != ESP_LOADER_SUCCESS )
				break;
			write_size -= count;
			fw_gui_progress_update(write_size);
		} // while ( write_size )

		if ( write_size || (flash_err != ESP_LOADER_SUCCESS) )
		{
			break;
		}
		// Last step to verify MD5
		flash_err = m1_fw_flash_binary(NULL, 0);
	    break;
	} // while (connect_to_target(ESP32_UART_BAUDRATE) == ESP_LOADER_SUCCESS)

	// Configure the BUTTON_RIGHT to input again
	GPIO_InitStruct.Pin = ESP32_IO9_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(ESP32_IO9_GPIO_Port, &GPIO_InitStruct);

	return flash_err;
} // static esp_loader_error_t m1_fw_app(FIL *hfile)



/******************************************************************************/
/**
  * @brief
  * @param None
  * @retval None
  */
/******************************************************************************/
static esp_loader_error_t m1_fw_flash_binary(uint8_t *payload, size_t size)
{
    esp_loader_error_t err;
    size_t written;
    static bool init_done = false;

    if ( !init_done )
    {
        printf("Erasing flash (this may take a while)...\r\n");
        err = esp_loader_flash_start(start_address, image_size, ESP32_IMAGE_CHUNK_SIZE);
        if (err != ESP_LOADER_SUCCESS)
        {
            printf("Erasing flash failed with error: %s.\r\n", get_error_string(err));
            if (err == ESP_LOADER_ERROR_INVALID_PARAM)
            {
                printf("If using Secure Download Mode, double check that the specified "
                       "target flash size is correct.\r\n");
            }
            return err;
        } // if (err != ESP_LOADER_SUCCESS)
        printf("Start programming\r\n");
        written = 0;
        init_done = true;
    } // if ( !init_done )

    if ( size )
    {
        err = esp_loader_flash_write(payload, size);
        if (err != ESP_LOADER_SUCCESS)
        {
            printf("\nPacket could not be written! Error %s.\r\n", get_error_string(err));
            return err;
        }

