sincere360/M1_SiN360/m1_csrc/m1_esp32_fw_update.c
        written += size;

        int progress = (int)(((float)written / image_size) * 100);
        printf("\rProgress: %d %%", progress);

        return ESP_LOADER_SUCCESS;
    };

    printf("\nFinished programming\r\n");
    init_done = false; // reset

#ifdef MD5_ENABLED
    err = esp_loader_flash_verify();
    if (err == ESP_LOADER_ERROR_UNSUPPORTED_FUNC)
    {
        printf("ESP8266 does not support flash verify command.\r\n");
        return err;
    }
    else if (err != ESP_LOADER_SUCCESS)
    {
        printf("MD5 does not match. Error: %s\r\n", get_error_string(err));
        return err;
    }
    printf("Flash verified\r\n");
#endif

    return ESP_LOADER_SUCCESS;
} // static esp_loader_error_t m1_fw_flash_binary(uint8_t *payload, size_t size)



/******************************************************************************/
/**
  * @brief
  * @param None
  * @retval None
  */
/******************************************************************************/
static uint16_t esp32_get_boot_info(uint8_t *boot_msg, uint16_t boot_msg_len, uint16_t *len)
{
	uint16_t scan, run, start, next_start;

	if ( boot_msg==NULL )
		return 0;

	run = 0;
	start = 0;
	next_start = 0;
	while ( run < boot_msg_len )
	{
		if ( boot_msg[run]==ESP32_BOOT_MESSAGE_LF ) // End of line found?
		{
			start = next_start;
			next_start = run + 1;
			for (scan=start; scan<run; scan++)
			{
				if ( boot_msg[scan]==ESP32_BOOT_MESSAGE_SEPARATOR )
					break;
			} // for (k=start; k<run; k++)
			break; // EOL found, let break
		} // if ( boot_msg[run]==ESP32_BOOT_MESSAGE_LF )
		run++;
	} // while ( run < boot_msg_len )

	*len = run + 1; // length of message ended by EOL
	if ( run < boot_msg_len ) // Possible search found?
	{
		if ( scan < run ) // Search found?
			return (scan + 1); // Skip the position of the ESP32_BOOT_MESSAGE_SEPARATOR
	} // if ( run < boot_msg_len )

	return 0;
} // static uint16_t esp32_get_boot_info(uint8_t *boot_msg, uint16_t boot_msg_len, uint16_t *len)



/******************************************************************************/
/**
  * @brief
  * @param None
  * @retval None
  */
/******************************************************************************/
void setting_esp32_gui_update(const S_M1_Menu_t *phmenu, uint8_t sel_item)
{
	uint8_t i, n_items;
	uint8_t menu_text_y;
	bool trunc;
	uint8_t prn_name[GUI_DISP_LINE_LEN_MAX + 1] = {0};
	uint16_t msg_len, msg_id;
	uint8_t *pboot_info;

	n_items = phmenu->num_submenu_items;
	menu_text_y = THIS_LCD_MENU_TEXT_FIRST_ROW_Y;

	/* Graphic work starts here */
	m1_u8g2_firstpage(); // This call required for page drawing in mode 1
    do
    {
    	for (i=0; i<n_items; i++)
    	{
    		if ( i==sel_item )
    		{
    			// Draw box for selected menu item with text color
    			u8g2_DrawBox(&m1_u8g2, 0, menu_text_y - THIS_LCD_MENU_TEXT_ROW_SPACE + 2, M1_LCD_SUB_MENU_TEXT_FRAME_W, THIS_LCD_MENU_TEXT_ROW_SPACE);
    			u8g2_SetDrawColor(&m1_u8g2, M1_DISP_DRAW_COLOR_BG); // set to background color
    			u8g2_SetFont(&m1_u8g2, M1_DISP_SUB_MENU_FONT_B);
    			u8g2_DrawStr(&m1_u8g2, 4, menu_text_y, phmenu->submenu[i]->title);
    			if ( i==1 ) // Index of the Start Address field
    			{
    		    	// Draw arrows left and right
    		    	u8g2_DrawXBMP(&m1_u8g2, M1_LCD_DISPLAY_WIDTH - 40, THIS_LCD_MENU_TEXT_FIRST_ROW_Y + 2, 10, 10, arrowleft_10x10);
    		    	u8g2_DrawXBMP(&m1_u8g2, M1_LCD_DISPLAY_WIDTH - 20, THIS_LCD_MENU_TEXT_FIRST_ROW_Y + 2, 10, 10, arrowright_10x10);
    			}
    			u8g2_SetDrawColor(&m1_u8g2, M1_DISP_DRAW_COLOR_TXT); // return to text color
    			u8g2_SetFont(&m1_u8g2, M1_DISP_SUB_MENU_FONT_N); // return to default font
    		}
    		else
    		{
    			u8g2_DrawStr(&m1_u8g2, 4, menu_text_y, phmenu->submenu[i]->title);
    		}
    		menu_text_y += THIS_LCD_MENU_TEXT_ROW_SPACE;
    	} // for (i=0; i<n_items; i++)

    	// Draw info box at the bottom
    	m1_info_box_display_init(true);

    	switch ( sel_item )
    	{
    		case 0: // Image file
    	    	if ( f_info && f_info->file_is_selected )
    	    	{
    	    		if ( strlen(f_info->file_name) > GUI_DISP_LINE_LEN_MAX )
    	    		{
    	    			strncpy(prn_name, f_info->file_name, GUI_DISP_LINE_LEN_MAX - 2);
    	    			prn_name[GUI_DISP_LINE_LEN_MAX - 2] = 0;
    	    			strcat(prn_name, "..");
    	    		}
    	    		else
    	    		{
    	    			strcpy(prn_name, f_info->file_name);
    	    		}
    	    	} // if ( f_info && f_info->file_is_selected )

    			switch ( esp32_update_status )
    			{
    				case M1_FW_UPDATE_READY:
    					m1_info_box_display_draw(INFO_BOX_ROW_1, prn_name);
    					break;

    				case M1_FW_IMAGE_FILE_ACCESS_ERROR:
    					m1_info_box_display_draw(INFO_BOX_ROW_1, "Image file error!");
    					break;

    				case M1_FW_CRC_FILE_ACCESS_ERROR:
    					m1_info_box_display_draw(INFO_BOX_ROW_1, "MD5 file error!");
    					break;

    				case M1_FW_CRC_FILE_INVALID:
		    			m1_info_box_display_draw(INFO_BOX_ROW_1, "Invalid MD5 file!");
						break;

    				case M1_FW_IMAGE_FILE_TYPE_ERROR:
    				case M1_FW_IMAGE_SIZE_INVALID:
		    			m1_info_box_display_draw(INFO_BOX_ROW_1, "Invalid image file!");
		    			break;

		    		case M1_FW_CRC_CHECKSUM_UNMATCHED:
		    			m1_info_box_display_draw(INFO_BOX_ROW_1, "Checksum failed!");
		    			break;

    				default:
    					break;
    			} // switch ( esp32_update_status )
    			break;

    		case 1: // Start address
    	    	sprintf(prn_name, "0x%06lX:", start_address);
    	    	m1_info_box_display_draw(INFO_BOX_ROW_1, prn_name);
    			break;

    		case 2: // Firmware update
    			switch ( esp32_update_status )
    			{
    				case M1_FW_UPDATE_READY:
    					m1_info_box_display_draw(INFO_BOX_ROW_1, "Ready to flash!");
    					break;

		    		case M1_FW_UPDATE_SUCCESS:
		    			m1_info_box_display_draw(INFO_BOX_ROW_1, "Update successfully!");
		    			esp32_update_status = M1_FW_UPDATE_NOT_READY; // Reset after process complete
		    			i = 0;
		    			msg_len = m1_ringbuffer_get_read_len(&esp32_rb_hdl);
		    			while ( msg_len )
		    			{
		    				pboot_info = m1_ringbuffer_get_read_address(&esp32_rb_hdl);
		    				msg_id = esp32_get_boot_info(pboot_info, msg_len, &msg_len);
		    				if ( msg_id )
		    				{
		    					if ( !i ) // First boot message
		    					{
		    						// Read part of the info message
		    						strncpy(prn_name, pboot_info + msg_id, msg_len - msg_id);
		    						m1_info_box_display_draw(INFO_BOX_ROW_2, prn_name);
		    						i++; // Move to next boot message
		    					} // if ( !i )
		    					else
		    					{
		    						// Read full info message
		    						msg_len = (msg_len <= GUI_DISP_LINE_LEN_MAX)?msg_len:GUI_DISP_LINE_LEN_MAX;
		    						strncpy(prn_name, pboot_info, msg_len);
		    						m1_info_box_display_draw(INFO_BOX_ROW_3, prn_name);
		    						break; // Having read enough info messages, let break
		    					} // else
		    				} // if ( msg_id )
		    				else
		    					break; // Do nothing if nothing found
		    				m1_ringbuffer_advance_read(&esp32_rb_hdl, msg_len); // Skip old message
		    				msg_len = m1_ringbuffer_get_read_len(&esp32_rb_hdl);
		    			} // while ( msg_len )
		    			break;

		    		case M1_FW_UPDATE_FAILED:
		    	    	m1_info_box_display_draw(INFO_BOX_ROW_1, "Update failed!");
		    			break;

		    		case M1_FW_UPDATE_LOW_BATTERY:
		    			m1_info_box_display_draw(INFO_BOX_ROW_1, "Battery level < 50%!");
		    			break;

    				default:
    					break;
    			} // switch ( esp32_update_status )
    			break;

    		default: // Unknown selection
    			break;
    	} // switch ( sel_item )
    } while (m1_u8g2_nextpage());

} // void setting_esp32_gui_update(const S_M1_Menu_t *phmenu, uint8_t sel_item)

